<!--
/*
 * WebIntegrator - Ferramenta de produtividade Java
 * Copyright (c) 2001-2008 Itx Tecnologia da Informação Ltda.
 *
 * Este programa é software livre; você pode redistribuí-lo e/ou modificá-lo 
 * sob os termos da GNU GENERAL PUBLIC LICENSE (GPL) conforme publicada pela 
 * Free Software Foundation; versão 2 da Licença.
 * Este programa é distribuído na expectativa de que seja útil, porém, SEM 
 * NENHUMA GARANTIA; nem mesmo a garantia implícita de COMERCIABILIDADE OU 
 * ADEQUAÇÃO A UMA FINALIDADE ESPECÍFICA.
 * 
 * Consulte a GNU GPL para mais detalhes.
 * Você deve ter recebido uma cópia da GNU GPL junto com este programa; se não, 
 * veja em http://www.gnu.org/licenses/ 
 */
-->

<html>
<head>
   <title>O que &eacute; o WebIntegrator?</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?secondtopic.html'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b>O que &#233; o WebIntegrator?
<br>
</b></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1.1',1,0)">In&iacute;cio</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.2',1,0)">Anterior</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.4',1,0)">Pr&oacute;ximo</a>
     </font>
    </td>
  </tr>
</table>
<br>


<span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">O WebIntegrator &#233; um servidor de aplica&#231;&#245;es web que possui o seu pr&#243;prio ambiente de desenvolvimento integrado (IDE) capaz de agilizar o desenvolvimento de aplica&#231;&#245;es web podendo acessar diversos tipos de fontes de dado oferecendo um modelo de programa&#231;&#227;o onde a camada da regra de neg&#243;cio (l&#243;gica) e a regra de apresenta&#231;&#227;o s&#227;o definidas separadamente facilitando a manuten&#231;&#227;o de um projeto e uma melhor distribui&#231;&#227;o de tarefas de uma equipe.
<br>

<br>
Focado na produtividade do desenvolvimento de aplica&#231;&#245;es web a IDE do WebIntegrator, o WI_Builder, necessita apenas de um browser para ser utilizada. Conectando-se com os principais bancos de dados do mercado via ODBC ou JDBC o WebIntegrator &#233; indicado tanto para o desenvolvimento de novas aplica&#231;&#245;es quanto para a evolu&#231;&#227;o de aplica&#231;&#245;es j&#225; existentes (sistemas legados)   podendo se conectar nativamente com bases de dados MUMPS (MJava), BR/Search, etc.
<br>

<br>
Funcionalidades como desvio condicional, notifica&#231;&#227;o por e-mail e anexa&#231;&#227;o de documentos permitem que com o WebIntegrator sejam constru&#237;das aplica&#231;&#245;es t&#237;picas de workflow. Atrav&#233;s de um mecanismo de conex&#227;o entre o cliente (browser) e o servidor de aplica&#231;&#245;es atrav&#233;s de um applet, o WebIntegrator tamb&#233;m pode executar transa&#231;&#245;es com um banco de dados sem a submiss&#227;o da p&#225;gina.
<br>

<br>
</span>

</body>
</html>