<html>
<head>
   <title>Vis&atilde;o Conceitual</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?des_conceito.html'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:MS Sans Serif; font-size:12pt; color:#000000"><b>Vis&#227;o Conceitual</b><span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b>
<br>
</b></span></span></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1.1',1,0)">In&iacute;cio</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.1',1,0)">Anterior</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.1.2',1,0)">Pr&oacute;ximo</a>
     </font>
    </td>
  </tr>
</table>
<br>


<div align="center"><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000"><img src="minilogowi.png" width="162" height="93" border="0" alt="minilogowi">
<br>
</div><span style="font-family:Helvetica,Arial; font-size:1pt; color:#000000"><hr></span><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>
</span><span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b><img src="seta.gif" width="15" height="15" border="0" alt="seta"> </b></span><span style="font-family:MS Sans Serif; font-size:12pt; color:#000000"><b>Vis&#227;o Conceitual</b></span><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>

<br>
</span><span style="font-family:Helvetica,Arial; font-size:1pt; color:#000000"><hr></span><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>
</span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">O WebIntegrator &#233; um Servidor de Aplica&#231;&#245;es Web com ambiente de desenvolvimento integrado, capaz de agilizar o desenvolvimento de aplica&#231;&#245;es cliente/servidor que usam o cliente HTML (browser) acessando bancos de dados, com total independ&#234;ncia entre os layouts das p&#225;ginas e a codifica&#231;&#227;o necess&#225;ria para carreg&#225;-las.
<br>

<br>
Um projeto &#233; composto por p&#225;ginas que correspondem a todas as interfaces de intera&#231;&#227;o com o usu&#225;rio. As p&#225;ginas devem ser criadas no ambiente de desenvolvimento do WebIntegrator (<b>WI Builder</b>) e editadas em qualquer editor HTML ou, at&#233; mesmo no pr&#243;prio Builder. Tudo que existir na p&#225;gina e que n&#227;o estiver entre | (pipes) ser&#225; desconsiderado pelo sistema. As demais estruturas ser&#227;o entendidas como vari&#225;veis (ou identificadores) e o sistema tentar&#225; substitu&#237;-las. Dessa forma, o desenvolvedor pode colocar Applets, Flash, links para p&#225;ginas ASP, p&#225;ginas PHP etc. sem que haja o menor tipo de problema de exclus&#227;o de c&#243;digo.
<br>

<br>
As vari&#225;veis podem ser do usu&#225;rio, do sistema, grids, combos etc. e quando referenciadas, o sistema as processa em tempo de execu&#231;&#227;o e substitue o seu conte&#250;do. Vari&#225;veis do usu&#225;rio ou do sistema podem ser referenciadas em v&#225;rios campos do <b>WI Builder</b>, como nos SQL, campos de defini&#231;&#227;o etc.
<br>

<br>
Quando um formul&#225;rio HTML &#233; submetido todas as vari&#225;veis n&#227;o come&#231;adas por "</span><span style="font-family:Courier New; font-size:10pt; color:#000000"><b>wi</b></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">" s&#227;o adicionadas ao contexto do usu&#225;rio (o contexto &#233; criado sempre que um novo browser &#233; aberto) podendo, ent&#227;o, ser referenciadas a qualquer momento.
<br>

<br>
Sempre que um comando SQL &#233; executado, o nome das suas colunas transformam-se em vari&#225;veis, passando a fazer parte do contexto e podendo ser referenciadas. Mas, diferentemente das vari&#225;veis do usu&#225;rio, ap&#243;s o t&#233;rmino do processamento do SQL elas s&#227;o removidas da mem&#243;ria, pois deixam de ter representatividade.
<br>
</span></span></span>

</body>
</html>
