<html>
<head>
   <title>Introdu&ccedil;&atilde;o ao WebIntegrator</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?introducao_webintegrator.html'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:MS Sans Serif; font-size:12pt; color:#000000"><b>Introdu&#231;&#227;o ao WebIntegrator
<br>
</b></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1.1',1,0)">In&iacute;cio</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1',1,0)">Anterior</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.1.1',1,0)">Pr&oacute;ximo</a>
     </font>
    </td>
  </tr>
</table>
<br>


<div align="center"><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000"><img src="minilogowi.png" width="162" height="93" border="0" alt="minilogowi">
<br>
</div><span style="font-family:MS Sans Serif; font-size:1pt; color:#000000"><hr></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>
</span><span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b><img src="seta.gif" width="15" height="15" border="0" alt="seta"> </b></span><span style="font-family:MS Sans Serif; font-size:12pt; color:#000000"><b>Introdu&#231;&#227;o ao WebIntegrator (Vers&#227;o IncognitaDigital)</b></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>

<br>
</span><span style="font-family:MS Sans Serif; font-size:1pt; color:#000000"><hr></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>
A Tecnologia Web, denomina&#231;&#227;o que se deu ao conjunto de protocolos e outros componentes de software sobre os quais se construiu a Internet, mostra a cada dia a sua superioridade, transformando-se na nova plataforma de suporte a sistemas de informa&#231;&#227;o, capaz de integrar, sem fronteiras tecnol&#243;gicas, as dimens&#245;es conhecidas como intranet, extranet e Internet. Em rela&#231;&#227;o ao modelo cliente/servidor tradicional, esta tecnologia apresenta as seguintes principais vantagens:
<br>

<br>
1.       Redu&#231;&#227;o dr&#225;stica do TCO. Diversos estudos comprovam que esta&#231;&#245;es de trabalho baseadas em browsers (thin-client) apresentam redu&#231;&#227;o do TCO de at&#233; quatro vezes em rela&#231;&#227;o aos PC (fat-client).
<br>

<br>
2.      Arquitetura aberta. A Tecnologia Web est&#225; fundada em protocolos e componentes de software totalmente abertos, muitos deles open-source. Isso significa mais flexibilidade para os desenvolvedores e independ&#234;ncia de fornecedor, al&#233;m de favorecer a interoperabilidade e a escalabilidade entre diferentes ambientes.
<br>

<br>
3.      Uso eficaz de recursos. Operando sob demanda, as aplica&#231;&#245;es constru&#237;das com a Tecnologia Web utilizam com muito mais efic&#225;cia recursos normalmente caros, como processos de usu&#225;rio, base do licenciamento de sistemas operacionais e de bancos de dados. Um &#250;nico processo de acesso a banco de dados, por exemplo, &#233; capaz de atender a m&#250;ltiplas requisi&#231;&#245;es vindas de v&#225;rios usu&#225;rios. Ou seja, os recursos s&#227;o alocados ao usu&#225;rio apenas enquanto durar sua conex&#227;o, possibilitando o acesso de maior n&#250;mero de usu&#225;rios concorrentes.
<br>

<br>
4.      Onipresen&#231;a. Enquanto no modelo tradicional &#233; preciso instalar a camada cliente em cada uma das esta&#231;&#245;es que ir&#225; executar determinada aplica&#231;&#227;o, no modelo Web o &#250;nico requisito &#233; a presen&#231;a de um browser na esta&#231;&#227;o de trabalho, que nem precisa ser um PC. Desse modo, resguardados os cuidados com a seguran&#231;a, uma aplica&#231;&#227;o pode ser acessada de qualquer lugar, inclusive fora dos muros das organiza&#231;&#245;es.
<br>

<br>
Nova interface. A interface gr&#225;fica da Tecnologia Web, baseada em linguagens de apresenta&#231;&#227;o como HTML e JavaScript, representa um novo paradigma onde prevalece a simplicidade e facilidade de uso, aliados a mais produtividade na sua constru&#231;&#227;o. Mesmo suportando conte&#250;do multim&#237;dia, a interface Web n&#227;o requer super esta&#231;&#245;es de trabalho para ser executada, ao contr&#225;rio da interface GUI tradicional.
<br>

<br>
</span></span></span>

</body>
</html>
