<html>
<head>
   <title>Licen&ccedil;a</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?licenca.html'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:MS Sans Serif; font-size:12pt; color:#000000"><b>Licen&#231;a
<br>
</b></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1.1',1,0)">In&iacute;cio</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.10.2',1,0)">Anterior</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.12',1,0)">Pr&oacute;ximo</a>
     </font>
    </td>
  </tr>
</table>
<br>


<span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>

<br>

<br>

<br>
<div align="center"><span style="font-family:Times New Roman; font-size:14pt; color:#000000">ITX Tecnologia da Informa&#231;&#227;o Ltda.
<br>
</div></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>
<div align="center"></span><span style="font-family:Times New Roman; font-size:12pt; color:#000000"><b>Termo de Licen&#231;a de Software para WebIntegrator</b></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>
</div>
<br>
</span><span style="font-family:Times New Roman; font-size:12pt; color:#000000">NOTA PARA O USU&#193;RIO:
<br>

<br>
Isto &#233; um contrato. Ao instalar este software voc&#234; aceita todos os termos e condi&#231;&#245;es deste Termo de Licen&#231;a.
<br>

<br>
CONDI&#199;&#213;ES DE LICENCIAMENTO:
<br>

<br>
Por este Termo de Licen&#231;a, a ITX fornece uma &#250;nica c&#243;pia n&#227;o-exclusiva e intransfer&#237;vel de uso do WebIntegrator, a ser instalada em uma &#250;nica unidade central de processamento, segundo os seguintes termos:
<br>

<br>
1. Uso do WebIntegrator:
<br>

<br>
O WebIntegrator ser&#225; obtido exclusivamente atrav&#233;s de download do site do produto </span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">(<span style="font-family:MS Sans Serif; font-size:10pt; color:#0000FF"><u><span class="weblink"><a href="http://www.webintegrator.com.br" target="_blank">http://www.webintegrator.com.br</a></span></u></span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">)</span><span style="font-family:Times New Roman; font-size:12pt; color:#000000">, podendo ser utilizado sob as restri&#231;&#245;es funcionais que n&#227;o exigem este Termo de Licen&#231;a e que caracterizam a vers&#227;o <b>WI Light</b>. Para uso de suas funcionalidades plenas, &#233; necess&#225;ria a obten&#231;&#227;o junto ao produtor ou a distribuidor autorizado (<b>WI Partner</b>) de chave de ativa&#231;&#227;o nominal e &#250;nica.
<br>

<br>
2. Copyright e direitos do autor:
<br>

<br>
O WebIntegrator &#233; de propriedade exclusiva da ITX Tecnologia da Informa&#231;&#227;o Ltda., sendo protegido pela legisla&#231;&#227;o brasileira e tratados internacionais.
<br>

<br>
3. Restri&#231;&#245;es:
<br>

<br>
O licenciado concorda explicitamente em n&#227;o modificar, adaptar, traduzir, praticar engenharia reversa, descompilar, desassemblar ou de alguma maneira tentar descobrir o c&#243;digo-fonte do WebIntegrator.
<br>

<br>
4. Garantia:
<br>

<br>
O WebIntegrator est&#225; sendo entregue como ele &#233;, n&#227;o podendo ser assegurada nenhuma garantia adicional quanto ao seu uso ou performance.
<br>

<br>
A ITX garante que o WebIntegrator cumpre com suas especifica&#231;&#245;es funcionais. Em caso de fal&#234;ncia, concordata ou desist&#234;ncia de continuidade do WebIntegrator, a ITX garante a imediata disponibiliza&#231;&#227;o de todo o seu c&#243;digo-fonte.
<br>

<br>
5. Documenta&#231;&#227;o complementar:
<br>

<br>
Juntamente com a c&#243;pia do WebIntegrator, segue a documenta&#231;&#227;o do produto, que tamb&#233;m &#233; de propriedade exclusiva da ITX e sobre a qual pesa igualmente as obriga&#231;&#245;es de sigilo e restri&#231;&#245;es aplic&#225;veis a ele.
<br>

<br>
6. Subscri&#231;&#227;o:
<br>

<br>
O licenciamento do WebIntegrator inclui uma Subscri&#231;&#227;o Anual que d&#225; direito aos servi&#231;os de suporte t&#233;cnico obtidos exclusivamente atrav&#233;s do site do produto </span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">(<span style="font-family:MS Sans Serif; font-size:10pt; color:#0000FF"><u><span class="weblink"><a href="http://www.webintegrator.com.br" target="_blank">http://www.webintegrator.com.br</a></span></u></span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">)</span><span style="font-family:Times New Roman; font-size:12pt; color:#000000"> e ao recebimento autom&#225;tico de todas as revis&#245;es, edi&#231;&#245;es e vers&#245;es, ambos v&#225;lidos pelo per&#237;odo de 12 (doze) meses contados a partir da data de emiss&#227;o da chave de ativa&#231;&#227;o do produto.</span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>

<br>
</span></span></span>

</body>
</html>
