<html>
<head>
   <title>HTML</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?prjgrd03.html'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:MS Sans Serif; font-size:12pt; color:#000000"><b>HTML
<br>
</b></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1.1',1,0)">In&iacute;cio</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.3.3.1',1,0)">Anterior</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.3.3.3',1,0)">Pr&oacute;ximo</a>
     </font>
    </td>
  </tr>
</table>
<br>


<div align="center"><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000"><img src="minilogowi.png" width="162" height="93" border="0" alt="minilogowi">
<br>
</div><span style="font-family:MS Sans Serif; font-size:1pt; color:#000000"><hr></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>
</span><span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b><img src="seta.gif" width="15" height="15" border="0" alt="seta"> Grid HTML</b></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>

<br>
</span><span style="font-family:MS Sans Serif; font-size:1pt; color:#000000"><hr></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">
<br>
O grid HTML assemelha-se em funcionalidade ao </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">grid&nbsp;SQL</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">, por&#233;m enquanto neste &#250;ltimo a fonte dos dados &#233; sempre o resultado de uma consulta feita a um banco de dados, no grid HTML a fonte dos dados &#233; vari&#225;vel a depender do tipo escolhido, podendo ser uma listagem de um diret&#243;rio de um servidor FTP ou de um diret&#243;rio da m&#225;quina onde est&#225; instalado o WebIntegrator, ou a lista de mensagens dispon&#237;veis em um servidor POP3, etc. Para saber mais sobre os tipos de grid HTML <a href=javaScript:parent.reDisplay('1.1.3',1,0)>clique aqui</a>.
<br>

<br>
O funcionamento e a defini&#231;&#227;o de modelos do grid HTML seguem o mesmo padr&#227;o de regras do grid SQL.
<br>

<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Compartilhado</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> indica qual o grid que ter&#225; seu modelo compartilhado, as altera&#231;&#245;es feitas no modelo do grid-pai ir&#227;o se refletir nos grids-filhos. Nessa combo apenas ser&#227;o exibidos os grids que possuem modelo simples ou m&#250;ltiplo n&#227;o sendo exibido os grids que possuem modelo compartilhado.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Cor</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> define o c&#243;digo hexadecimal de uma cor que ser&#225; aplicada nas linhas pares das linhas de detalhe do grid. A cor padr&#227;o &#233; aquela definida no arquivo que cont&#233;m o esquema visual do grid e a cor das linhas pares &#233; a definida neste campo. Lembrar que esse par&#226;metro altera a cor da linha, logo, se o desenvolvedor definir uma cor espec&#237;fica para uma c&#233;lula, ela ir&#225; sobrepor esta defini&#231;&#227;o.
<br>

<br>
Clicando em </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Cor</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> aparecer&#225; uma janela com algumas gamas de cores que ao se passar o mouse sobre elas, exibe-se o c&#243;digo hexadecimal correspodente &#224; cor.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Descri&#231;&#227;o</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> serve para que o desenvolvedor da aplica&#231;&#227;o escreva um breve coment&#225;rio sobre a a&#231;&#227;o a ser executada pelo componente em quest&#227;o.
<br>

<br>
A op&#231;&#227;o </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Gerar</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> indica se o WebIntegrator ir&#225; gerar o modelo simples do grid baseado nas configura&#231;&#245;es atuais. O modelo s&#243; ser&#225; criado ap&#243;s a grava&#231;&#227;o da defini&#231;&#227;o. Esse campo apenas se refere aos grids que utilizem o modelo simples.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Colunado</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> define em quantas colunas ser&#227;o exibidas as linhas de detalhe definidas no modelo do grid. Quando um grid &#233; colunado as linhas que formam o cabe&#231;alho e o rodap&#233; n&#227;o podem conter mais de uma c&#233;lula.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Disposi&#231;&#227;o</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> define a forma que os valores ser&#227;o dispostos quando o grid &#233; colunado.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Identificador</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> serve para que o desenvolvedor entre com um identificador &#250;nico para o componente de p&#225;gina ou de projeto que est&#225; sendo definido. Ser&#225; atrav&#233;s desse identificador que o componente e/ou seus valores ser&#227;o referenciado nas p&#225;ginas do projeto.
<br>

<br>
A depender do componente que se estiver definindo para que o mesmo seja referenciado numa p&#225;gina ser&#225; necess&#225;rio o acr&#233;scimo de um prefixo como &#233; o caso dos componentes Grid e Combo, nesses dois casos &#233; obrigat&#243;rio o uso dos prefixos </span><span style="font-family:Courier New; font-size:10pt; color:#000000">grid.</span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> e </span><span style="font-family:Courier New; font-size:10pt; color:#000000">combo.</span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> antes dos respectivos identificadores para que o conte&#250;do correto seja exibido.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">In&#237;cio&nbsp;na&nbsp;Linha</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> indica qual linha da tabela HTML que est&#225; definida como modelo do grid que ser&#225; a linha de detalhe, ou seja, a linha que ter&#225; seu conte&#250;do processado e populado de acordo com o resultado da consulta. Esse campo apenas se refere aos grids que utilizem o modelo simples.
<br>

<br>
A op&#231;&#227;o M&#250;ltiplo marcada indica que o grid usar&#225; o modelo m&#250;ltiplo para gera&#231;&#227;o do conte&#250;do, para editar as v&#225;rias partes do modelo m&#250;ltiplo clique no &#237;cone <img src="prop.png" width="14" height="13" border="0" alt="prop"> que aparece na sess&#227;o <b>Modelo</b>. O modelo m&#250;ltiplo trabalha com as v&#225;rias partes que em conjunto ir&#227;o criar o modelo do grid, as partes consistem na defini&#231;&#227;o do conte&#250;do do cabe&#231;alho, o conte&#250;do do &#237;n&#237;cio do registro, o conte&#250;do a ser iteragido quando forem encontrados registros v&#225;lidos, o conte&#250;do a ser exibido em registros vazios (apenas utilizado quando o deslocamento horizontal est&#225; configurado), o conte&#250;do que indica o fim de um registro, o conte&#250;do a ser exibido quando nenhum registro for retornado pela consulta e o rodap&#233; do grid.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Quantidade</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> define quantas linhas ser&#227;o exibidas por p&#225;gina. Caso o n&#250;mero de linhas retornadas seja maior que a quantidade definida o usu&#225;rio poder&#225; fazer uso da propriedade </span><span style="font-family:Courier New; font-size:10pt; color:#000000">link</span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> (</span><span style="font-family:Courier New; font-size:10pt; color:#000000">|grid.&lt;identificador-do-grid&gt;.link|</span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">) que gerar&#225; uma barra de navega&#231;&#227;o com links para acessar as pr&#243;ximas linhas ou retornar &#224;s linhas anteriores.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Executar&nbsp;a&nbsp;Cada&nbsp;Registro</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> indica qual a p&#225;gina do projeto que ser&#225; executada a cada itera&#231;&#227;o nos registros retornados como resultado da consulta feita ao banco de dados.
<br>

<br>
A op&#231;&#227;o </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Simples</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> marcada indica que o grid usar&#225; o modelo simples para gera&#231;&#227;o do conte&#250;do, para editar o modelo do grid clique no &#237;cone que aparece na sess&#227;o <b>Modelo</b>. O modelo simples consiste na defini&#231;&#227;o de uma tabela HTML onde cada linha tem um fun&#231;&#227;o dependendo do valor definido no campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">In&#237;cio&nbsp;na&nbsp;Linha</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000">. A linha indicada por esse campo ser&#225; iteragida e populada com os valores vindos da consulta &#224; fonte de dados, as linhas acima desta s&#227;o consideradas como o cabe&#231;alho do grid, as linhas que se encontrarem abaixo dela ser&#227;o consideradas como as linhas de rodap&#233;.
<br>

<br>
O campo </span><span style="font-family:Courier New; font-size:10pt; color:#000000"><span style="font-family:Courier New; font-size:10pt; color:#0000FF">Tipo</span></span></span><span style="font-family:MS Sans Serif; font-size:10pt; color:#000000"> indica o tipo de grid que ser&#225; gerado, a depender do tipo escolhido determinadas vari&#225;veis de contexto estar&#227;o dispon&#237;veis para serem referenciadas no modelo. Para saber mais sobre os tipos <a href=javaScript:parent.reDisplay('1.1.3',1,0)>clique aqui</a>.
<br>

<br>
</span></span></span>

</body>
</html>
